# === user env核心 ===
brew "gh"
brew "just"
brew "nushell"
brew "mise"
brew "chezmoi"

# === CLI 增强 ===
brew "starship"
brew "carapace"
# brew "fd"
brew "ripgrep"
brew "dust"   # 分析,脚本, 还有些脚本会依赖du
brew "ncdu"   # 日常干活
brew "tealdeer"
brew "gtrash"
brew "jq"
brew "gum"
brew "translate-shell"
brew "gopass"
brew "age"

# === ai+TUI 工作流 ===
brew "yazi"
brew "zellij"
brew "helix"
brew "lazygit"
brew "onefetch"
brew "scc"
brew "gemini-cli"
brew "distrobox"
brew "btop"
brew "podman-tui"

# === Git ===
brew "git-delta"
# brew "lefthook"
# brew "gitleaks"
brew "git-lfs"

# ===== Monitor =====
#brew "watchexec"
brew "lnav"
# brew "tailspin"
# brew "viddy"
#brew "angle-grinder"

#vm
brew "qemu"

# ===== Containers =====
brew "docker-compose"
# brew "dive"
# brew "hadolint"
# brew "syft"
# brew "k9s"

# 网络
brew "curlie"               # curl 封装 (像 httpie)
brew "mosh"
#brew "sshs"                # https://github.com/caelansar/termirs也行, sshTUI客户端可能是伪需求, 如果你一开始就在zellij中连接
brew "doggo"
# brew "trippy"
brew "croc"       # 存在内网/防火墙阻隔的临时跨机传输, 不想搞 SSH 密钥、不想配安全组端口穿透
# brew "miniserve"
# brew "websocat"
# brew "zrok"

# sre
brew "ansible"

# 测试与性能
brew "fio"
# brew "oha"
# brew "ffuf"   
# brew "hyperfine"
brew "posting"

# 数据库
# brew "sqlfluff"
# brew "gobackup"
# brew "usql"

# === Security ===
# brew "trivy"
# brew "rustscan"
# brew "lynis"

# ===== Docs =====
# brew "pandoc"

# =====yazi预览 =====
brew "ffmpegthumbnailer"
brew "p7zip"
brew "poppler"
brew "chafa"
brew "glow"
brew "bat"
